"0x0000" = "Off";
"0x0001" = "Auto";
"0x0002" = "Off";
"0x0003" = "Fill Flash";
"0x0004" = "Auto Red Eye Reduction";
"0x0005" = "Red Eye Reduction";
"0x0006" = "External Sync";
"0x8001" = "Slow Sync";
"0x8003" = "Rear Sync";
"0x8004" = "Wireless";
"0x8021" = "HSS Auto";
"0x8022" = "HSS Fill";
"0x8024" = "HSS WL";
"0x8031" = "Slow Sync (Red Eye Reduction)";
"0x8032" = "Slow Sync";
"0x8041" = "Slow Sync Wireless";
"0x8042" = "Rear Sync Wireless";
